profiling/results/stage-5_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.176ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.729ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms    2.30ms  55.10ms   94.56%
    Req/Sec   528.74    114.75     1.44k    73.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.73ms
 75.000%    3.60ms
 90.000%    4.61ms
 99.000%   10.65ms
 99.900%   33.34ms
 99.990%   53.79ms
 99.999%   55.13ms
100.000%   55.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.590     0.000000            1         0.00
       1.621     0.100000         5000 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.958     0.200000        10011         0.00
       2.213     0.300000        14998        -0.00
       2.463     0.400000        20007        -0.00
       2.727     0.500000        24988         0.00
       2.867     0.550000        27517 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       3.021     0.600000        30002         0.00
       3.191     0.650000        32493        -0.00
       3.387     0.700000        34995        -0.00
       3.603     0.750000        37496         0.00
       3.723     0.775000        38749 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       3.855     0.800000        39976         0.00
       4.001     0.825000        41225        -0.00
       4.167     0.850000        42476        -0.00
       4.359     0.875000        43734         0.00
       4.479     0.887500        44352 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.607     0.900000        44984         0.00
       4.755     0.912500        45604        -0.00
       4.947     0.925000        46233        -0.00
       5.183     0.937500        46849         0.00
       5.347     0.943750        47160 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       5.539     0.950000        47471         -nan
       5.771     0.956250        47789        -0.00
       6.083     0.962500        48096        -0.00
       6.519     0.968750        48407         0.00
       6.751     0.971875        48564 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       7.083     0.975000        48720         -nan
       7.479     0.978125        48876        -0.00
       8.023     0.981250        49032        -0.00
       8.831     0.984375        49188         0.00
       9.199     0.985938        49267 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       9.647     0.987500        49345         0.00
      10.247     0.989062        49422        -0.00
      11.023     0.990625        49500        -0.00
      11.823     0.992188        49579         0.00
      12.599     0.992969        49617 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      13.719     0.993750        49657         0.00
      14.735     0.994531        49695        -0.00
      16.463     0.995313        49734        -0.00
      18.143     0.996094        49773         0.00
      19.711     0.996484        49793 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      20.767     0.996875        49812         -nan
      21.903     0.997266        49832        -0.00
      23.503     0.997656        49851        -0.00
      24.943     0.998047        49871         0.00
      25.983     0.998242        49881 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      27.247     0.998437        49891         -nan
      28.831     0.998633        49900        -0.00
      30.431     0.998828        49910        -0.00
      33.919     0.999023        49920         0.00
      34.687     0.999121        49925 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      35.775     0.999219        49929         0.00
      39.519     0.999316        49934        -0.00
      40.959     0.999414        49939        -0.00
      42.207     0.999512        49944         0.00
      43.775     0.999561        49947 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      45.311     0.999609        49949         0.00
      47.007     0.999658        49951        -0.00
      47.679     0.999707        49954        -0.00
      47.903     0.999756        49956         0.00
      49.087     0.999780        49958 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      49.887     0.999805        49959         -nan
      52.063     0.999829        49960        -0.00
      52.479     0.999854        49961        -0.00
      53.375     0.999878        49962         0.00
      53.791     0.999890        49963 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      53.855     0.999902        49964         -nan
      53.855     0.999915        49964        -0.00
      54.079     0.999927        49965        -0.00
      54.079     0.999939        49965         0.00
      54.207     0.999945        49966 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      54.207     0.999951        49966         0.00
      54.207     0.999957        49966        -0.00
      54.271     0.999963        49967        -0.00
      54.271     0.999969        49967         0.00
      54.271     0.999973        49967 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      54.271     0.999976        49967         0.00
      54.271     0.999979        49967        -0.00
      55.135     0.999982        49968        -0.00
      55.135     1.000000        49968         0.00
#[Mean    =        3.126, StdDeviation   =        2.296]
#[Max     =       55.104, Total count    =        49968]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59986 requests in 1.00m, 3.83MB read
Requests/sec:    999.85
Transfer/sec:     65.42KB